# Development Tools
brew "lazygit"        # Terminal UI for git commands - makes git operations visual and intuitive
brew "lazydocker"     # Terminal UI for Docker - manage containers, images, and volumes easily
brew "neovim"         # Hyperextensible Vim-based text editor - modern fork with better plugin support
brew "gh"             # GitHub CLI - work with issues, PRs, releases, and more from the terminal
brew "tmux"           # Terminal multiplexer - multiple terminal sessions in one window
brew "pnpm"           # Fast, disk space efficient package manager for Node.js
brew "bun"            # Fast all-in-one JavaScript runtime, bundler, test runner, and package manager
brew "node"           # JavaScript runtime built on Chrome's V8 JavaScript engine
brew "fnm"            # Fast Node Manager - simple, fast Node.js version manager built in Rust
brew "stripe"         # Stripe CLI for testing and managing Stripe resources
brew "supabase"       # Supabase CLI for local development and deployment
brew "mysql"          # Open source relational database management system
brew "opencode"       # Open source code editor/IDE

# System Monitoring
brew "fastfetch"      # System information tool - displays system info with style
brew "btop"           # Resource monitor - beautiful and powerful alternative to htop/top

# Utilities
brew "fzf"            # Command-line fuzzy finder - search through files, history, processes, and more
brew "ffmpeg"         # Multimedia framework for converting audio, video, and streaming
brew "mas"            # Mac App Store command-line interface
brew "powerlevel10k"  # A fast reimplementation of Powerlevel9k ZSH theme with even more features

# Applications

## Terminal & Development
cask "ghostty"                # Fast, native terminal emulator with GPU acceleration and modern features
cask "visual-studio-code"     # Powerful, extensible code editor
cask "cursor"                 # AI-powered code editor built to make you extraordinarily productive
cask "zed"                    # High-performance code editor designed for collaboration with humans and AI
cask "claude"                 # Claude AI assistant desktop application
cask "codex"                  # Code editor and IDE
cask "android-studio"         # Official IDE for Android app development
cask "tableplus"              # Modern, native database management tool
mas "Xcode", id: 497799835    # Apple's IDE for developing apps for Apple platforms
mas "WiFi Explorer", id: 494803304  # WiFi network scanner and analyzer

## Productivity
cask "raycast"                # Productivity launcher with extensions - replaces Spotlight with superpowers
cask "1password"              # Password manager and secure wallet
cask "cleanshot"              # Advanced screenshot and screen recording tool
cask "linear-linear"          # Modern project management and issue tracking for product teams
mas "Flighty", id: 1358823008 # Live flight tracker with detailed flight data and notifications

## Communication
cask "slack"                  # Team communication and collaboration
cask "discord"                # Voice, video, and text communication
mas "WhatsApp Messenger", id: 310633997  # Messaging app for text, voice, and video calls

## Browsers
cask "google-chrome"          # Fast, secure web browser
cask "firefox"                # Privacy-focused web browser
mas "uBlock Origin Lite", id: 6745342698  # Lightweight ad blocker for Safari

## Design
cask "figma"                  # Collaborative design and prototyping tool
cask "sketch"                 # Native macOS design toolkit for UI/UX designers
cask "pixelsnap"              # Measure anything on your screen with pixel precision

## Games
cask "powder"                 # The Powder Toy - physics sandbox game
