# Development Tools
brew "lazygit"        # Terminal UI for git commands - makes git operations visual and intuitive
brew "lazydocker"     # Terminal UI for Docker - manage containers, images, and volumes easily
brew "neovim"         # Hyperextensible Vim-based text editor - modern fork with better plugin support
brew "gh"             # GitHub CLI - work with issues, PRs, releases, and more from the terminal
brew "tmux"           # Terminal multiplexer - multiple terminal sessions in one window
brew "pnpm"           # Fast, disk space efficient package manager for Node.js
brew "oven-sh/bun/bun"            # Fast all-in-one JavaScript runtime, bundler, test runner, and package manager
brew "node"           # JavaScript runtime built on Chrome's V8 JavaScript engine
brew "fnm"            # Fast Node Manager - simple, fast Node.js version manager built in Rust
brew "stripe"         # Stripe CLI for testing and managing Stripe resources
brew "supabase"       # Supabase CLI for local development and deployment
brew "mysql"          # Open source relational database management system
brew "opencode"       # Open source code editor/IDE

# System Monitoring
brew "fastfetch"      # System information tool - displays system info with style
brew "btop"           # Resource monitor - beautiful and powerful alternative to htop/top

# Utilities
brew "fzf"            # Command-line fuzzy finder - search through files, history, processes, and more
brew "ffmpeg"         # Multimedia framework for converting audio, video, and streaming
brew "mas"            # Mac App Store command-line interface
brew "powerlevel10k"  # A fast reimplementation of Powerlevel9k ZSH theme with even more features

# Applications

## Terminal & Development
cask "ghostty"                # Fast, native terminal emulator with GPU acceleration and modern features
cask "visual-studio-code"     # Powerful, extensible code editor
cask "cursor"                 # AI-powered code editor built to make you extraordinarily productive
cask "zed"                    # High-performance code editor designed for collaboration with humans and AI
cask "claude"                 # Claude AI assistant desktop application
cask "codex"                  # Code editor and IDE
cask "android-studio"         # Official IDE for Android app development
cask "tableplus"              # Modern, native database management tool
mas "Xcode", id: 497799835              # Apple's IDE for developing apps for Apple platforms
mas "TestFlight", id: 899247664           # Beta testing for apps before App Store release
mas "Apple Developer", id: 640199958      # WWDC sessions, documentation, and developer news
mas "WiFi Explorer", id: 494803304        # WiFi network scanner and analyzer

## Productivity
cask "raycast"                           # Productivity launcher with extensions - replaces Spotlight with superpowers
cask "1password"                         # Password manager and secure wallet
cask "cleanshot"                         # Advanced screenshot and screen recording tool
cask "linear-linear"                     # Modern project management and issue tracking for product teams
mas "Things 3", id: 904280696            # Award-winning personal task manager
mas "Copilot", id: 1447330651            # Smart personal finance tracker
mas "Flighty", id: 1358823008            # Live flight tracker with detailed flight data and notifications

## Communication
mas "Slack", id: 803453959               # Team communication and collaboration
cask "discord"                           # Voice, video, and text communication
mas "Telegram", id: 747648890            # Fast, secure cloud-based messaging
mas "WhatsApp Messenger", id: 310633997  # Messaging app for text, voice, and video calls

## Browsers
cask "google-chrome"          # Fast, secure web browser
cask "firefox"                # Privacy-focused web browser
mas "uBlock Origin Lite", id: 6745342698  # Lightweight ad blocker for Safari

## Design
cask "figma"                  # Collaborative design and prototyping tool
mas "Sketch", id: 1667260533  # Native macOS design toolkit for UI/UX designers
cask "pixelsnap"              # Measure anything on your screen with pixel precision

## Apple Suite
mas "Final Cut Pro", id: 424389933        # Professional video editing software
mas "Logic Pro", id: 634148309            # Professional music production and audio editing
mas "Motion", id: 434290957               # Motion graphics and visual effects for Final Cut Pro
# mas "Compressor", id: 424390742           # Video and audio encoding for Final Cut Pro
mas "MainStage", id: 634159523            # Live performance audio workstation
mas "GarageBand", id: 682658836           # Music creation studio for beginners
mas "iMovie", id: 408981434               # Simple video editing for home movies
mas "Keynote", id: 409183694              # Presentation software with stunning animations
mas "Pages", id: 409201541                # Word processor with beautiful templates
mas "Numbers", id: 409203825              # Spreadsheet app with powerful visualizations
mas "Photomator", id: 1444636541          # Professional photo editor with AI-powered tools
mas "Pixelmator Pro", id: 1289583905      # Professional image editing with ML-powered tools

## Games
cask "powder"                 # The Powder Toy - physics sandbox game
