# Taps
tap "851-labs/tap"                         # 851 Labs tap for casks
tap "anomalyco/tap"                        # Tap for opencode and related tools

# Development Tools
brew "lazygit"                            # Terminal UI for git commands - makes git operations visual and intuitive
brew "docker"                              # Docker CLI - command-line interface for interacting with Docker
brew "colima"                              # Docker-compatible container runtime for macOS using Lima
cask "orbstack"                            # Fast, lightweight Docker & Linux VM runtime for macOS
brew "lazydocker"                         # Terminal UI for Docker - manage containers, images, and volumes easily
brew "neovim"                             # Hyperextensible Vim-based text editor - modern fork with better plugin support
brew "gh"                                 # GitHub CLI - work with issues, PRs, releases, and more from the terminal
brew "tmux"                               # Terminal multiplexer - multiple terminal sessions in one window
brew "pnpm"                               # Fast, disk space efficient package manager for Node.js
brew "oven-sh/bun/bun"                    # Fast all-in-one JavaScript runtime, bundler, test runner, and package manager
brew "node"                               # JavaScript runtime built on Chrome's V8 JavaScript engine
brew "fnm"                                # Fast Node Manager - simple, fast Node.js version manager built in Rust
brew "rbenv"                              # Ruby version manager - simple, lightweight Ruby environment manager
brew "stripe/stripe-cli/stripe"                             # Stripe CLI for testing and managing Stripe resources
brew "supabase"                           # Supabase CLI for local development and deployment
brew "flyctl"                             # Fly.io CLI for app deployment and infrastructure management
brew "cloudflare-wrangler"                 # Cloudflare Wrangler CLI for Workers development and deployment
brew "mysql"                              # Open source relational database management system
brew "anomalyco/tap/opencode"             # Open source code editor/IDE

# System Monitoring
brew "fastfetch"                          # System information tool - displays system info with style
brew "btop"                               # Resource monitor - beautiful and powerful alternative to htop/top
cask "stats"                              # Menu bar system monitor - CPU, GPU, RAM, disk, network, battery
cask "daisydisk"                          # Disk space analyzer - visualize and clean up disk usage
cask "bartender"                          # Menu bar manager - hide and organize menu bar icons

# Utilities
brew "fzf"                                # Command-line fuzzy finder - search through files, history, processes, and more
brew "ffmpeg"                             # Multimedia framework for converting audio, video, and streaming
brew "mas"                                # Mac App Store command-line interface
brew "powerlevel10k"                      # A fast reimplementation of Powerlevel9k ZSH theme with even more features
cask "handbrake-app"                      # Video transcoder for converting video formats

# Applications

## Terminal & Development
cask "ghostty"                            # Fast, native terminal emulator with GPU acceleration and modern features
cask "visual-studio-code"                 # Powerful, extensible code editor
cask "cursor"                             # AI-powered code editor built to make you extraordinarily productive
cask "zed"                                # High-performance code editor designed for collaboration with humans and AI
cask "claude"                             # Claude AI assistant desktop application
cask "claude-code"                        # Claude AI coding assistant for the terminal
cask "codex"                              # OpenAI's Codex CLI - coding agent that runs in your terminal
cask "opencode-desktop"                   # Desktop app for OpenCode AI coding assistant
cask "android-studio"                     # Official IDE for Android app development
cask "tableplus"                          # Modern, native database management tool

## Productivity
cask "raycast"                            # Productivity launcher with extensions - replaces Spotlight with superpowers
cask "851-labs/tap/char"                  # Word counter tool
cask "851-labs/tap/window-in-picture"     # Menubar picture-in-picture window mirror
cask "851-labs/tap/gardenbridge"          # Drag and drop content between Mac and Vision Pro
cask "1password"                          # Password manager and secure wallet
cask "1password-cli"                      # 1Password CLI for scripting and automation
cask "cleanshot"                          # Advanced screenshot and screen recording tool
cask "linear-linear"                      # Modern project management and issue tracking for product teams
cask "notion"                             # All-in-one workspace for notes, docs, and collaboration
cask "notion-calendar"                    # Calendar app integrated with Notion

## Communication
cask "discord"                            # Voice, video, and text communication

## Browsers
cask "google-chrome"                      # Fast, secure web browser
cask "firefox"                            # Privacy-focused web browser
cask "cloudflare-warp"                    # Fast, secure VPN and DNS resolver
cask "tailscale-app"                      # Zero config VPN for secure networking between devices

## Design
cask "figma"                              # Collaborative design and prototyping tool
cask "pixelsnap"                          # Measure anything on your screen with pixel precision

## Games
cask "powder"                             # The Powder Toy - physics sandbox game
